app/controllers/center_users_controller.rb

	def profiles
		begin
			if !current_center_user.first_name.nil?
				@center_user = CenterUser.find(current_center_user.id)
---
SELECT `center_users`.* FROM `center_users` WHERE `center_users`.`id` = 1 ORDER BY `center_users`.`id` ASC LIMIT 1

	def update_profile
		begin
			@center_user_id = Base64.decode64(params[:id])
			puts @center_user_id
			@center_user=CenterUser.find(@center_user_id)
			@center_user.update_attributes!(params[:center_user])
---
SELECT `center_users`.* FROM `center_users` WHERE `center_users`.`id` = 1 ORDER BY `center_users`.`id` ASC LIMIT 1
UPDATE `center_users` SET `first_name` = 'luis ', `last_name` = 'dominguez', `gender` = 'Male', `street_addres` = 'huinala apodaca nuevo leon', `zip_code` = 66600, `age` = 23, `updated_at` = '2014-09-09 22:28:12' WHERE `center_users`.`id` = 1